myhumankit/au-taf/code/Projects/STM32F429I-Discovery/Applications/au-taf/Src/main.c
/**
  ******************************************************************************
  * @file    Touch_Panel/main.c
  * @author  MCD Application Team
  * @version V1.0.1
  * @date    11-November-2013
  * @brief   This example describes how to configure and use the touch panel 
  *          mounted on STM32F429I-DISCO boards.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdarg.h>
#include <stdbool.h>
#include <math.h>
#include "fonts.h"
#include "main.h"
//#include "timer.h"
#include "serial.h"

#include "stm32f4xx_ll_gpio.h"
#include "stm32f4xx_ll_tim.h"
#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_dma2d.h"

#include "buffer.h"

#define __PV_LANGUAGE_FRENCH__

#include "pv_picovoice.h"
#include "pv_porcupine_mcu.h"


#include "pv_audio_rec.h"
#include "pv_st_f429.h"

#include "base.h"
#include "debug.h"
#include "pico.h"

#include "constant.h"

extern uint8_t user_config[];
//#define FLASH_CONFIG_ADDRESS ((uint8_t *)0x081C0000)
#define FLASH_CONFIG_ADDRESS (user_config)

#define PIXEL_16BITS

#define TRANSPARENT_ENTRY 0x8410
#define BACKGROUND_PLANE  (0xD0000000)
#define FOREGROUND_PLANE  (0xD0028000)

#define DISPLAY_WIDTH  320
#define DISPLAY_HEIGHT 240

BUFFER_MANAGEMENT_DEC(1024,uint8_t,Serial)

extern Serial_t SerialCmdRxBuffer;
extern Serial_t SerialCmdTxBuffer;

/** @addtogroup STM32F429I_DISCOVERY_Examples
  * @{
  */

/** @addtogroup Touch_Panel
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

#define DYNAMIC_ALLOCATION 0
#define BUFFER_SIZE      64
#define U32_BUFFER_SIZE       256

#include "blocks.h"

/* Private functions ---------------------------------------------------------*/

/**
  * @brief   Main program
  * @param  None
  * @retval None
  */

void debug_local(void);
void timerLoop(void);

void put_c(char c)
{
#if 1
    SerialBufferPush(&SerialCmdTxBuffer, c); 
#endif
}


#define printf myprintf

char *hexa = "0123456789ABCDEF";

void myprintf(char *fmt,...)
{
  va_list ap;
  char c;
  char *(levels[2]);
  int level = 0;
  char buffer[32];
  char *end;
  uint32_t v;
  
  va_start(ap,fmt);
  
  levels[level] = fmt;
  while (((c = *levels[level]++) != 0) || (level != 0)) {
    if (c == 0) {
      level--;
      continue;
    }
    if ((c == '%') && (level == 0)) {
      c = *levels[level]++;
      if (c != '%') {
        int pre = 0;
        int post = 0;
        while ((c >= '0') && (c <= '9')) {
          pre = pre * 10 + c - '0';
          c = *levels[level]++;
        }
        if (c == '.') {
          c = *levels[level]++;
          while ((c >= '0') && (c <= '9')) {
            post = post * 10 + c - '0';
            c = *levels[level]++;
          }
        }
        if (c == 's') {
          level++;
          levels[level] = va_arg(ap,char *);
        } else if (c == 'x') {
          level++;
          end = buffer + sizeof(buffer) - 1;
          *end-- = '\0';
          v = va_arg(ap,uint32_t);
          do {
            *end-- = hexa[v & 0x0F];
            v = v >> 4;
            post--;
          } while ((v != 0) || (post > 0));
          levels[level] = end+1;
        }
        continue;
      }
    }
    put_c(c);
  }
  va_end(ap);
}


void error_handler(void) {
    while(true);
}

#define STM32__DISPLAY__CLEAR 0
#define STM32__DISPLAY__SET_FONT_24 1
#define STM32__DISPLAY__SET_FONT_8 2
#define STM32__DISPLAY__TEXT 3
#define STM32__DISPLAY__SET_COLORS 4

typedef struct {
  int   state;
  int16_t hspace;
  int16_t vspace;
} displayContext_t;

displayContext_t displayContext;


void displayRequestHandler(uint8_t *pData, int16_t length)
{
  int16_t index = 0;
  uint16_t x;
  uint16_t y;
  uint16_t l;
  uint16_t w;
  int16_t  i;

  while (index < length) {
    switch(pData[index]) {
    case STM32__DISPLAY__CLEAR:
      BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
      {
        int i;
        uint16_t *p = (uint16_t *)FOREGROUND_PLANE;
        for (i = 0;i < 320*240;i++) {
          *p++ = 0;
        }
      }
      //BSP_LCD_FillRect(0,0,240,320);
      index++;
      break;
    case STM32__DISPLAY__SET_FONT_24:
      BSP_LCD_SetFont(&Font24);
      displayContext.hspace = 16;
      displayContext.vspace = 16;
      index++;
      break;
    case STM32__DISPLAY__SET_FONT_8:
      BSP_LCD_SetFont(&Font8);
      displayContext.hspace = 8;
      displayContext.vspace = 8;
      index++;
      break;
    case STM32__DISPLAY__TEXT:
      y = pData[index+1];
      x = pData[index+2]<<1;
      l = pData[index+3];
      index += 4;
      w = BSP_LCD_GetFont()->Width;
      for (i = 0;i<l;i++) {
	BSP_LCD_DisplayChar(x, y, pData[index++]);
#ifdef FONT_MAG2
	x += 2*w;
#else      
	x += w;
#endif      
      }
      break;
    case STM32__DISPLAY__SET_COLORS:
      x = (pData[index+2] << 8) + pData[index+1];
      BSP_LCD_SetTextColor(x);
      x = (pData[index+4] << 8) + pData[index+3];
      BSP_LCD_SetBackColor(x);
      index += 5;
      break;
    default:
      index++;
      break;
    }
  }
}

