myhumankit/au-taf/code/Projects/STM32F429I-Discovery/Applications/au-taf/Src/main.c
void displayInit(void)
{
  //displayContext.state = DISPLAY_INITIAL_STATE;
  displayContext.hspace = 16;
}

void displayLoop(void)
{
}

uint8_t l1_frame[256];

void displayNLines(
		   char *pStatus,
		   int nLines,
		   char **pLines,
		   int selection)
{
  uint8_t *pData;
  uint8_t l;
  char *s;
  int i;
  int col = 0;
  int previous_col = -1;
  

  pData = l1_frame;

  *pData++ = STM32__DISPLAY__CLEAR;

  *pData++ = STM32__DISPLAY__SET_FONT_8;

  *pData++ = STM32__DISPLAY__SET_COLORS;
  *pData++ = 0xf8;
  *pData++ = 0x00;
  *pData++ = 0x07;
  *pData++ = 0xff;
  *pData++ = STM32__DISPLAY__TEXT;
  l = strlen(pStatus);
  *pData++ = 5;
  *pData++ = 5;
  *pData++ = l;
  memcpy(pData,pStatus,l);
  pData += l;
  
  *pData++ = STM32__DISPLAY__SET_FONT_24;


  for (i = 0;i < nLines;i++) {
    s = pLines[i];
    if ( s != NULL) {
      if (selection == i) {
	col = 2;
      } else {
	col = 1;
      }
      if (col != previous_col) {
	*pData++ = STM32__DISPLAY__SET_COLORS;
	if (col == 2) {
	  *pData++ = 0xf8;
	  *pData++ = 0x00;
	} else {
	  *pData++ = 0x07;
	  *pData++ = 0xe0;
	}
	*pData++ = 0x07;
	*pData++ = 0xff;
	previous_col = col;
      }
      
      *pData++ = STM32__DISPLAY__TEXT;
      l = strlen(s);
      *pData++ = 30+i*40;
      *pData++ = 5;
      *pData++ = l;
      memcpy(pData,s,l);
      pData += l;
    }
  }
  displayRequestHandler(l1_frame,pData-l1_frame);
}





#define LEVEL_NB 5
typedef struct {
    uint8_t tokens[LEVEL_NB];
    uint8_t action;
} sequence_t;

typedef struct {
    uint8_t token;
    uint8_t state;
} allowed_t;


typedef struct {
    allowed_t *alloweds;
    uint8_t alloweds_nb;
    uint8_t action;
} state_t;


#define CONTEXT_TOKEN_NB 10

enum {
    STATE_IDLE,
    STATE_COMMAND
};

typedef struct {
  uint32_t update;
  uint8_t hours;
  uint8_t minutes;
  uint8_t seconds;
  uint8_t day;
  uint8_t month;
  uint8_t year;
  uint8_t wday;  
} rtc_context_t;

typedef struct {
  int  serialLine;
  bool power_off_displayed;
  rtc_context_t rtc;
  void *phone_context;
} stm32_context_t;



#define PHONE_N1 5
#define PHONE_N2 5
#define PHONE_N3 5


typedef struct {
  char name[12];
  char number[16];
} directory_leaf_t;

typedef struct {
  char name[12];
} directory_branch_t;

typedef struct {
  directory_branch_t branches_1[PHONE_N1];
  directory_branch_t branches_2[PHONE_N1*PHONE_N2];
  directory_leaf_t leaves[PHONE_N1*PHONE_N2*PHONE_N3];
} directory_t;


typedef struct {
  int level;
  int state;
  uint8_t choices[4];
  directory_t *directory;
  int to_adb[2];
  int from_adb[2];
  char serialNumber[17];
  bool gprs_present;
} phone_context_t;


typedef struct choice {
  uint16_t current_menu_offset;
  uint16_t current_choice;
  uint16_t current_first_choice;
  uint32_t action_id;
  bool     phone;
} choice_t;

typedef struct config {
  uint16_t strings_number;
  uint16_t strings_start_length;
  uint16_t strings_length;
  uint16_t actions_length;
  uint16_t menus_length;
  uint16_t starting_menu_offset;
  uint16_t word_number;
  uint8_t  lang[2];
  uint16_t access_key_offset;
  uint16_t words_info_offset;
  uint16_t directory_offset;
  uint8_t  data[0];
} config_t;


#define CAPTURE_SIZE 1024

typedef struct {
  uint16_t rd_index;
  uint16_t wr_index;
  uint16_t size;
  bool display;
  uint32_t data[CAPTURE_SIZE];
} capture_context_t;

#define COMPARE_SIZE 512

typedef struct {
  uint32_t data[COMPARE_SIZE];
  bool sending;
} compare_context_t;

#define LEVELS_NB 4

typedef struct context {
  uint16_t *pStringsStart;
  char *pStrings;
  uint8_t *pCommandsStart;
  uint8_t *pCommands;
  uint8_t *pActions;
  //uint16_t *pMenuOffsets;
  uint8_t *pMenus;
  config_t *pConfig;
//  pthread_t eventThreadId;
#ifndef MONO  
  int locutor;
#endif  
  bool veille;
  bool phone;
  uint8_t aaa_toggle;
  char status[20];
  uint16_t current_choice;
  uint16_t current_first_choice;
  uint16_t current_choice_level;
  uint16_t current_menu_offset;
  uint32_t action_id;
  uint32_t num_value;
  choice_t choices[LEVELS_NB];
  stm32_context_t stm32_context;
  phone_context_t phone_context;
  capture_context_t capture_context;
  compare_context_t compare_context;
  pico_context_t pico_context;  
} context_t;



void context_init(context_t *pContext)
{
  memset(pContext,0,sizeof(*pContext));
  pContext->veille = true;
  pContext->action_id = 0;
  pContext->phone = false;
  pContext->stm32_context.phone_context = &pContext->phone_context;
}

void load_config(context_t *pContext, uint8_t *pConfigRaw)
{
  config_t *pConfig;
  int offset;
  
  pConfig = (config_t *)pConfigRaw;
  
  offset = sizeof(config_t);

  pContext->pStringsStart = (uint16_t *)(offset + (char *)pConfig);
  offset += pConfig->strings_start_length;

  pContext->pStrings = (char *)(offset + (char *)(pConfig));
  offset += pConfig->strings_length;

  pContext->pActions = (uint8_t *)(offset + (char *)pConfig);
  offset += pConfig->actions_length;

  pContext->pMenus = (uint8_t *)(offset + (char *)pConfig);
  offset += pConfig->menus_length;

  pContext->pConfig = pConfig;
  return;
}

int load_picovoice_config(pico_context_t *pContext, uint8_t *pConfigRaw)
{
  config_t *pConfig;
  char *lang = PICOVOICE_LANGUAGE;
  int i;
  
  pConfig = (config_t *)pConfigRaw;
  
  if ((pConfig->lang[0] != lang[0]) || 
      (pConfig->lang[1] != lang[1])) {
      return 1;
  }

  if (pConfig->word_number > MAX_WORDS_NB) {
    return 1;
  }
  pContext->access_key = (char *)(pConfigRaw + pConfig->access_key_offset);
  pContext->num_keywords = pConfig->word_number;
  pContext->sensitivities = (float *)(pConfigRaw + pConfig->words_info_offset);
  pContext->sizes = (int32_t *)(&pContext->sensitivities[pContext->num_keywords]);
  for (i = 0;i < pConfig->word_number;i++) {
    pContext->models[i] = (pv_porcupine_t *)(pConfigRaw + *(uint32_t*)&pContext->sizes[pContext->num_keywords+i]);
  }
  return 0;
}


uint32_t get_uint32(uint8_t *pData)
{
  return(pData[0] +
	 (pData[1] << 8) +
	 (pData[2] << 16) +
	 (pData[3] << 24));
}

uint16_t get_uint16(uint8_t *pData)
{
  return(pData[0] +
	 (pData[1] << 8));
}


void displayPhone(phone_context_t *pContext,
		  stm32_context_t *pStm32)
{
  char *s;
  int i;
  uint16_t c1;
  uint16_t c2;
  int sel_i = 0;
  char *lines[5];
  

