myhumankit/au-taf/code/Projects/STM32F429I-Discovery/Applications/au-taf/Src/main.c
  for (i = 0;i < PHONE_N1;i++) {
    s = NULL;
    if (pContext->level == 0) {
      if (pContext->directory->branches_1[i].name[0] != '\0') {
	s = pContext->directory->branches_1[i].name;
      }
    } else if (pContext->level == 1) {
      c1 = pContext->choices[0] * PHONE_N1;
      if (pContext->directory->branches_2[c1+i].name[0] != '\0') {
	s = pContext->directory->branches_2[c1+i].name;
      }
    } else if (pContext->level == 2) {
      c1 = pContext->choices[0] * PHONE_N1;
      c2 = (c1 + pContext->choices[1]) * PHONE_N2;
      if (pContext->directory->leaves[c2+i].name[0] != '\0') {
	s = pContext->directory->leaves[c2+i].name;
	sel_i = pContext->choices[2];
      }
    }
    lines[i] = s;
  }
  sel_i = pContext->choices[pContext->level];

  displayNLines("telephone",PHONE_N1,lines,sel_i);

#ifdef DEBUG
  fprintf(stderr,
	  "Phone %d %d %d\r\n",
	  pContext->level,
	  pContext->choices[0],
	  pContext->choices[1]);
#endif  
}



void display(context_t *pContext)
{
  int i;
  int j;
  int position = 0;
  uint8_t current_menu_length;
  uint32_t content_offset;
  uint32_t label_id;
  char *label;
  char *lines[5];

  memset(lines,0,sizeof(lines));
  if (pContext->veille) {
    char current_time[8];

    //get_rtc(&pContext->stm32_context);
    pContext->stm32_context.rtc.hours = 0x13;
    pContext->stm32_context.rtc.minutes = 0x25;

    lines[0] = "VEILLE";
    
    sprintf(current_time," %2x:%02x",
	    pContext->stm32_context.rtc.hours,
	    pContext->stm32_context.rtc.minutes);
    lines[1] = current_time;
    displayNLines(
		  "--",
		  5,
		  lines,
		  pContext->current_choice-pContext->current_first_choice);
  } else if (pContext->phone) {
    printf("Display Phone\r\n");
    displayPhone(&pContext->phone_context,&pContext->stm32_context);
  } else {
    current_menu_length = pContext->pMenus[pContext->current_menu_offset];
    position = 0;
    for (i = 0;i < pContext->current_choice_level;i++) {
      content_offset = pContext->choices[i].current_menu_offset+1+
	3*pContext->choices[i].current_choice;
      label_id = pContext->pMenus[content_offset];
      for (j = 0;j < 3;j++) {
	pContext->status[position++] = pContext->pStrings[pContext->pStringsStart[label_id]+j];
      }
      pContext->status[position++] = ' ';
    }
    pContext->status[position] = '\0';
    for (i = 0;i < 5;i++) {
      if (pContext->current_first_choice + i < current_menu_length) {
	content_offset = pContext->current_menu_offset+1+3*(i+pContext->current_first_choice);
	label_id = pContext->pMenus[content_offset];
	label = &pContext->pStrings[pContext->pStringsStart[label_id]];
	lines[i] = label;
      } else {
	printf("\r\n");
      }
    }
    displayNLines(
		  pContext->status,
		  5,
		  lines,
		  pContext->current_choice-pContext->current_first_choice);
  }
}

void back(context_t *pContext)
{
  if (pContext->veille == false) {
    if (pContext->phone) {
    } else if (pContext->current_choice_level > 0) {
      pContext->current_choice_level--;
      
      pContext->current_menu_offset = pContext->choices[pContext->current_choice_level].current_menu_offset;
      pContext->current_choice = pContext->choices[pContext->current_choice_level].current_choice;
      pContext->current_first_choice = pContext->choices[pContext->current_choice_level].current_first_choice;
      pContext->action_id = pContext->choices[pContext->current_choice_level].action_id;
      pContext->phone = pContext->choices[pContext->current_choice_level].phone;
    } else {
      pContext->veille = true;
      pContext->action_id = 0;
    }
  }
}



void process(context_t *pContext, int command)
{
  uint8_t current_menu_length;
  uint16_t offset;
  uint16_t action_offset;
  uint8_t cmd;
  uint16_t menu_id;
  uint8_t choice_id;
  uint32_t code;

  if (pContext->veille) {
    if (((pContext->pico_context.num_keywords == 4) &&  (command == CMD_COMMAND)) ||
	((pContext->pico_context.num_keywords == 3) &&  (command == CMD_BACK))) {
#ifndef MONO
      pContext->locutor = command;
#endif    
      pContext->current_choice_level = 0;
      pContext->veille = false;
      pContext->current_menu_offset = pContext->pConfig->starting_menu_offset;
      pContext->current_choice = 0;
      pContext->current_first_choice = 0;
    }
  } else if (pContext->phone) {
    int level;
    
    level = pContext->phone_context.level;
    if (command == CMD_NEXT) {
      if (pContext->phone_context.choices[level] >= LEVELS_NB) {
        pContext->phone_context.choices[level] = 0;
      } else {
        pContext->phone_context.choices[level]++;
      }
    } else if (command == CMD_OK) {
      if (level == 2) {
        uint16_t c;
        c = pContext->phone_context.choices[0];
        c = c * PHONE_N1 + pContext->phone_context.choices[1];
        c = c * PHONE_N2 + pContext->phone_context.choices[2];
        //phone_dial(&pContext->phone_context,c);
        /* Get out phone mode */
        pContext->phone = false;
      } else {
        pContext->phone_context.level++;
      }
    } else if (command == CMD_BACK) {
      if (level == 0) {
        pContext->phone = false;
      } else {
        pContext->phone_context.level--;
      }
    }
  } else {
    if (command == CMD_NEXT) {
      current_menu_length = pContext->pMenus[pContext->current_menu_offset];
      if (pContext->current_choice + 1 >= current_menu_length) {
        pContext->current_choice = 0;
        pContext->current_first_choice = 0;
      } else {
        pContext->current_choice += 1;
        if (pContext->current_choice >= pContext->current_first_choice + 5) {
          pContext->current_first_choice = pContext->current_choice - 4;
        }
      }
    } else if (command == CMD_OK) {
      offset = pContext->current_menu_offset+1+3*pContext->current_choice;
      action_offset = pContext->pMenus[offset+1] +
        (pContext->pMenus[offset+2] << 8);
      while (pContext->pActions[action_offset] != COMMANDS__END) {
        cmd = pContext->pActions[action_offset];
        printf("cmd %x\r\n",cmd);
        switch (cmd) {
        case COMMANDS__MENU:
          menu_id = pContext->pActions[action_offset+1] +
            (pContext->pActions[action_offset+2] << 8);
	  printf("menu %x\r\n",menu_id);
          pContext->choices[pContext->current_choice_level].current_menu_offset =
            pContext->current_menu_offset;
          pContext->choices[pContext->current_choice_level].current_choice =
            pContext->current_choice;
          pContext->choices[pContext->current_choice_level].current_first_choice =
            pContext->current_first_choice;
          pContext->choices[pContext->current_choice_level].action_id =
            pContext->action_id;
          pContext->choices[pContext->current_choice_level].phone =
            pContext->phone;
          
          choice_id = pContext->pMenus[offset];
          pContext->action_id = pContext->action_id * (pContext->pConfig->strings_number+1) + choice_id + 1;
          pContext->current_menu_offset = menu_id;
          pContext->current_choice = 0;
          pContext->current_first_choice = 0;
          pContext->current_choice_level += 1;
          action_offset += 3;
          break;
        case COMMANDS__DIRECTORY:
          printf("Passage en mode PHONE\r\n");
          pContext->phone = true;
          pContext->phone_context.level = 0;
          memset(&pContext->phone_context.choices,0,sizeof(pContext->phone_context.choices));
          action_offset += 1;
          break;
        case COMMANDS__INFRA_RED__PHILIPS:
        case COMMANDS__INFRA_RED__AKAI:
        case COMMANDS__INFRA_RED__AAA:
        case COMMANDS__INFRA_RED__RC5:
          {
            uint32_t time;
            uint32_t n = 0;

            switch(cmd) {
              case COMMANDS__INFRA_RED__AAA:
		set_modulation(RATE_33KHz);
		break;
              case COMMANDS__INFRA_RED__PHILIPS:
		set_modulation(RATE_33KHz);
		break;
              case COMMANDS__INFRA_RED__AKAI:
		set_modulation(RATE_36KHz);
		break;
              case COMMANDS__INFRA_RED__RC5:
		set_modulation(RATE_33KHz);
		break;
	    }
	    
            code = pContext->pActions[action_offset+1] +
              (pContext->pActions[action_offset+2] << 8) +
              (pContext->pActions[action_offset+3] << 16) +
              (pContext->pActions[action_offset+4] << 24);
              
            pContext->compare_context.sending = true;
            mux_set_switch(MUX_SWITCH_INFRA_RED);
            
            time = TIM5->CNT + 10000;
            
            switch(cmd) {
              case COMMANDS__INFRA_RED__AAA:
		n = generate_aaa(time,code,pContext->compare_context.data,COMPARE_SIZE);
                break;
              case COMMANDS__INFRA_RED__PHILIPS:
                n = generate_philips(time,code,pContext->compare_context.data,COMPARE_SIZE);
                break;
              case COMMANDS__INFRA_RED__AKAI:
                n = generate_akai(time,code,pContext->compare_context.data,COMPARE_SIZE);
                break;
              case COMMANDS__INFRA_RED__RC5:
                n = generate_rc5(time,code,pContext->compare_context.data,COMPARE_SIZE);
                break;
            }
            if (n != 0) {
              timer_send(time,pContext->compare_context.data,n);
            }
	    printf("IR %x %x\r\n",code,n);
          }
          action_offset += 5;
          break;
        case COMMANDS__RF_433__PEREL:
          {
            uint32_t time;
            uint32_t n = 0;
            
            code = pContext->pActions[action_offset+1] +
              (pContext->pActions[action_offset+2] << 8) +
              (pContext->pActions[action_offset+3] << 16) +
              (pContext->pActions[action_offset+4] << 24);
              
            pContext->compare_context.sending = true;
            mux_set_switch(MUX_SWITCH_RF_433);
            time = TIM5->CNT + 10000;
            
            n = generate_perel(time,code,pContext->compare_context.data,COMPARE_SIZE);
            if (n != 0) {
              timer_send(time,pContext->compare_context.data,n);
            }
	    printf("RF %x %x\r\n",code,n);
          }
          action_offset += 5;
          break;
        case COMMANDS__PHONE__DIAL:
	  printf("DIAL\r\n");
          action_offset += 2 + pContext->pActions[action_offset+1];
          break;
        case COMMANDS__PHONE__SMS:
	  printf("SMS %x",action_offset);
	  printf(" %x",pContext->pActions[action_offset+1]);
          // Number
          action_offset += 2 + pContext->pActions[action_offset+1];
          // Content
	  printf(" %x",pContext->pActions[action_offset]);
          action_offset += 1 + pContext->pActions[action_offset];
	  printf(" %x\r\n",action_offset);
          break;
        case COMMANDS__PHONE__HANGUP:
          action_offset ++;
	  printf("Racc\r\n");
          break;
        case COMMANDS__PHONE__UNHOOK:
          action_offset ++;
	  printf("Decr\r\n");
          break;
        case COMMANDS__PHONE__VOL_H:
	  printf("VOL +\r\n");
          action_offset ++;
          break;
        case COMMANDS__PHONE__VOL_L:
	  printf("VOL -\r\n");
          action_offset ++;
          break;
	default:
	  return;
        }
      }
    } else if (command == CMD_BACK) {
      back(pContext);
    }
  }
}



void load_directory(phone_context_t *pContext, void *raw)
{
  config_t *pConfig = raw;

  pContext->directory = (directory_t *)((uint8_t *)raw + pConfig->directory_offset);
}


context_t myContext;

int main(void)
{
  int32_t  count = 0;
  pv_status_t status;
  
  status = pv_board_init();
  if (status != PV_STATUS_SUCCESS) {
    error_handler();
  }
  
  /*!< At this stage the microcontroller clock setting is already configured, 
  this is done through SystemInit() function which is called from startup
  file (startup_stm32f429_439xx.s) before to branch to application main.
  To reconfigure the default setting of SystemInit() function, refer to
  system_stm32f4xx.c file
  */

  // ---------- SysTick timer -------- //
  if (SysTick_Config(SystemCoreClock / 1000)) 
    {
      // Capture error
      while (1)
	{
	}
    }

  /* remap vector table */
  if (( 0xFF000000 & (uint32_t)main ) ==
      ( 0xFF000000 & (uint32_t)&count ))
    {
      *(uint32_t *)0x40013800 = 3;
      *(uint32_t *)0xE000ED08 = 0;
    }
    
