myhumankit/au-taf/code/Projects/STM32F429I-Discovery/Applications/au-taf/Src/main.c
  __HAL_RCC_SYSCFG_CLK_ENABLE();
  
  BSP_SDRAM_Initialization_sequence(REFRESH_COUNT);
  
  /* LCD initialization */
  BSP_LCD_Init();
  
  /* LCD Layer initialization */
  BSP_LCD_LayerDefaultInit(LCD_BACKGROUND_LAYER,BACKGROUND_PLANE);
  BSP_LCD_LayerDefaultInit(LCD_FOREGROUND_LAYER,FOREGROUND_PLANE);

  BSP_LCD_SetColorKeying(LCD_FOREGROUND_LAYER,0x848284);

  {
    int i;
    for (i = 0;i < DISPLAY_WIDTH * DISPLAY_HEIGHT;i++) {
      *(uint16_t *)(FOREGROUND_PLANE + 2 * i) = TRANSPARENT_ENTRY;
    }
  }

  /* Set LCD foreground layer */
  BSP_LCD_SetLayerVisible(LCD_FOREGROUND_LAYER, ENABLE);
  BSP_LCD_SetLayerVisible(LCD_BACKGROUND_LAYER, ENABLE);  
  
  BSP_LCD_SelectLayer(LCD_FOREGROUND_LAYER);

  BSP_LCD_SetFont(&Font24);

  BSP_LCD_SetBackColor(TRANSPARENT_ENTRY);

  BSP_LCD_SetTextColor(LCD_COLOR_BLACK); 

  serialInit();
  
  spiInit();
  
  l3gd20_set_three_state();

  timerInit(&myContext.capture_context.data,CAPTURE_SIZE);
  
  debug_init();
  
  debug_local();
  
  debug_start();

  displayInit();
  
  context_init(&myContext);

  {
    context_t *pContext = &myContext;

    pContext->capture_context.size = CAPTURE_SIZE;
    pContext->capture_context.wr_index = 0;
    pContext->capture_context.rd_index = 0;
    pContext->capture_context.display = false;
    pContext->compare_context.sending = false;
  }
  
  load_config(&myContext,FLASH_CONFIG_ADDRESS);


  load_directory(&myContext.phone_context,FLASH_CONFIG_ADDRESS);
  
  display(&myContext);

  {
    const uint8_t *board_uuid = pv_get_uuid();
    printf("UUID: ");
    for (uint32_t i = 0; i < pv_get_uuid_size(); i++) {
      printf(" %.2x", board_uuid[i]);
    }
  }
  
  printf("\r\n");

  if (load_picovoice_config(&myContext.pico_context,FLASH_CONFIG_ADDRESS) != 0) {
    char *lines[] = {"","BAD","LANGUAGE","",""};
    displayNLines(
		  "ERROR",
		  5,
		  lines,
		  0);
  }
  myContext.pico_context.handle = NULL;

  status = pico_init(&myContext.pico_context);
  
  if (status != PV_STATUS_SUCCESS) {
      printf("Pico init failed with '%s'", pv_status_to_string(status));
      error_handler();
  }
  

  while (1)
  {
    const int16_t *buffer = pv_audio_rec_get_new_buffer();
    if (buffer) {
      status = pico_process(&myContext.pico_context,buffer);
      if (status != PV_STATUS_SUCCESS) {
        printf("Picovoice process failed with '%s'", pv_status_to_string(status));
        error_handler();
      }
    }
    
    debug_loop();
    
    displayLoop();

    timerLoop();
 
    if ( USART1->SR & 0x0F) {
        USART1->DR;
    }
    if ( DMA1->HISR & 0x3F00) {
        /* Error on stream 5 */
        DMA1->HIFCR = (DMA1->HISR & 0x3F00);
	LL_DMA_DisableStream( DMA1, LL_DMA_STREAM_5 );
    }
    if ( DMA2->LISR & 0x3F0000) {
        /* Error on stream 2 */
        DMA2->LIFCR = (DMA2->LISR & 0x3F0000);
	LL_DMA_EnableStream( DMA2, LL_DMA_STREAM_2 );
    }
    
    SerialCmdRxBuffer.header.ui16WriteIndex = sizeof(SerialCmdRxBuffer.pData);
    SerialCmdRxBuffer.header.ui16WriteIndex -= DMA2_Stream2->NDTR;
    
    if (USART1->SR & USART_FLAG_TXE) {
        int c;
        c = debug_get_next_char();
        if (c != -1) {
            USART1->DR = c;
        } else if (bufferIsEmpty(&SerialCmdTxBuffer.header) == 0) {
          uint8_t c;
          c = SerialBufferPop(&SerialCmdTxBuffer);
          debug_putc(c);
        }
    }
    if (bufferIsEmpty(&SerialCmdRxBuffer.header) == 0) {
      uint8_t c;
      c = SerialBufferPop(&SerialCmdRxBuffer);
      debug_add_char(c);
    }

  }
}


#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif



int debug_clear_handler(debug_context_t *pContext)
{
    uint8_t command[] = { STM32__DISPLAY__CLEAR};

    displayRequestHandler(command,sizeof(command));
    return 0;
}

int debug_test_handler(debug_context_t *pContext)
{
    uint16_t x;
    uint16_t y;
    
    uint8_t command[] = { STM32__DISPLAY__SET_FONT_24,
      STM32__DISPLAY__TEXT,
      0,
      0>>1,
      2,'-','X'};
    if (debug_next_field() == 0) {
        return 0;
    }
    x = ltoi((char *)&pContext->line.data[pContext->field_start],16);
    if (debug_next_field() == 0) {
        return 0;
    }
    y = ltoi((char *)&pContext->line.data[pContext->field_start],16);

    command[2] = x & 0xff;
    command[3] = y >> 1;
    
    displayRequestHandler(command,sizeof(command));
    return 0;
}

int debug_color_handler(debug_context_t *pContext)
{
    uint16_t fore;
    uint16_t back;
    uint8_t command[] = { STM32__DISPLAY__SET_COLORS,
      0,0,0,0
    };
    
    if (debug_next_field() == 0) {
        return 0;
    }
    fore = ltoi((char *)&pContext->line.data[pContext->field_start],16);
    if (debug_next_field() == 0) {
        return 0;
    }
    back = ltoi((char *)&pContext->line.data[pContext->field_start],16);
    
    command[1] = fore & 0xff;
    command[2] = (fore >> 8) & 0xff;
    command[3] = back & 0xff;
    command[4] = (back >> 8) & 0xff;
    
    displayRequestHandler(command,sizeof(command));
    return 0;
}

int debug_lcd_on_handler(debug_context_t *pContext)
{
    BSP_LCD_DisplayOn();
    return 0;
}
int debug_lcd_off_handler(debug_context_t *pContext)
{
    BSP_LCD_DisplayOff();
    return 0;
}

int debug_capture_handler(debug_context_t *pContext)
{
  context_t *pUserContext;
  int enable = 0;
  int n;
  
  if (debug_next_field() == 0) {
    return 0;
  }
  enable = ltoi((char *)&pContext->line.data[pContext->field_start],16);

  if (debug_next_field() == 0) {
    return 0;
  }
  n = ltoi((char *)&pContext->line.data[pContext->field_start],16);
  
  pUserContext = pContext->user_context;

  mux_set_switch(n);
  
