myhumankit/au-taf/code/Projects/STM32F429I-Discovery/Applications/au-taf/Src/main.c
  /* 
   * Initialize pointers to current values 
   */
  pUserContext->capture_context.wr_index = pUserContext->capture_context.size - DMA1_Stream4->NDTR;
  pUserContext->capture_context.rd_index = pUserContext->capture_context.wr_index;
  pUserContext->capture_context.display = enable;
  return 0;
}

int debug_date_handler(debug_context_t *pContext)
{
  context_t *pUserContext;
  int code = 0;
  
  if (debug_next_field() == 0) {
    return 0;
  }
  code = ltoi((char *)&pContext->line.data[pContext->field_start],16);
  pUserContext = pContext->user_context;

  pUserContext->compare_context.sending = true;
  timer_send(code,pUserContext->compare_context.data,COMPARE_SIZE);
  return 0;
}

int debug_time_handler(debug_context_t *pContext)
{
  context_t *pUserContext;
  int code = 0;
  
  if (debug_next_field() == 0) {
    return 0;
  }
  code = ltoi((char *)&pContext->line.data[pContext->field_start],16);
  pUserContext = pContext->user_context;

  pUserContext->compare_context.sending = true;
  timer_send(code,pUserContext->compare_context.data,COMPARE_SIZE);
  return 0;
}

int debug_spi_handler(debug_context_t *pContext)
{
  int i;
  uint8_t data[5];

  for (i = 0;i < 5;i++) {
    if (debug_next_field() == 0) {
      break;
    }
    data[i] = ltoi((char *)&pContext->line.data[pContext->field_start],16);
  }
  spi_send(data,i);
  return 0;
}


int hotword_handler(int hot)
{
    process(&myContext,hot);
    display(&myContext);
    return 0;
}

int debug_hotword_handler(debug_context_t *pContext)
{
    uint16_t hot;
    
    if (debug_next_field() == 0) {
        return 0;
    }
    hot = ltoi((char *)&pContext->line.data[pContext->field_start],16);
    
    process(&myContext,hot);
    display(&myContext);
    return 0;
}
  
static debug_command_t locals[] = {
    { .name = "color",
      .help = "Defines fore and back ground colors",
      .handler = debug_color_handler,
      .next = NULL},
    { .name = "clear",
      .help = "Clears the display",
      .handler = debug_clear_handler,
      .next = NULL},
    { .name = "capture",
      .help = "0/1 mux : Disable/Enable the display of captured data with switch selecting mux",
      .handler = debug_capture_handler,
      .next = NULL},
    { .name = "hotword",
      .help = "n : Acts as hotword n is detected",
      .handler = debug_hotword_handler,
      .next = NULL},
    { .name = "text",
      .help = "Tests the display",
      .handler = debug_test_handler,
      .next = NULL},
    { .name = "date",
      .help = "Set RTC date YYYY/MM/DD",
      .handler = debug_date_handler,
      .next = NULL},
    { .name = "spi",
      .help = "Send up to 5 bytes on SPI",
      .handler = debug_spi_handler,
      .next = NULL},
    { .name = "time",
      .help = "Set RTC time hh:mm",
      .handler = debug_time_handler,
      .next = NULL},
    { .name = "lcd_on",
      .help = "enables lcd display",
      .handler = debug_lcd_on_handler,
      .next = NULL},
    { .name = "lcd_off",
      .help = "disables lcd display",
      .handler = debug_lcd_off_handler,
      .next = NULL}
};

void debug_local(void)
{
  debug_add_commands(locals,SIZEOF(locals));
    debug_set_user_context(&myContext);
}
void timerLoop()
{
  context_t *pContext = &myContext;

  if (pContext->capture_context.display) {
    pContext->capture_context.wr_index = pContext->capture_context.size - DMA1_Stream4->NDTR;
    if ((pContext->capture_context.wr_index != pContext->capture_context.rd_index) &&
	(debug_tx_empty())) {
      uint32_t value;
      uint8_t text[16];

      value = pContext->capture_context.data[pContext->capture_context.rd_index];
      pContext->capture_context.rd_index = (pContext->capture_context.rd_index + 1) & (pContext->capture_context.size - 1);
      fmt_hexa32(text,value);
      text[8] = '\r';
      text[9] = '\n';
      text[10] = '\0';
      debug_puts((char *)text);
    }
  }
  if (pContext->compare_context.sending) {
    if ((DMA1->LISR & 0x2C) &&
	((int32_t)(TIM5->CNT-TIM5->CCR3) > 100)) {
	LL_DMA_DisableStream( DMA1, LL_DMA_STREAM_0 );
        /* Error or end on stream 0 */
        DMA1->LIFCR = (DMA1->LISR & 0x3F);
	LL_TIM_CC_DisableChannel(TIM5,LL_TIM_CHANNEL_CH3);
	{
	  LL_GPIO_InitTypeDef   GPIO_InitStructure;
	  
	    GPIO_InitStructure.Pin = LL_GPIO_PIN_2;
	    GPIO_InitStructure.Mode = LL_GPIO_MODE_OUTPUT;
	    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
	    GPIO_InitStructure.Speed = LL_GPIO_SPEED_FREQ_MEDIUM;
	    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
	    GPIO_InitStructure.Alternate = LL_GPIO_AF_2;
	    LL_GPIO_Init(GPIOA, &GPIO_InitStructure);
	}
	
	pContext->compare_context.sending = false;
    }
  }
}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

/*
 * Info en flash :
 * - palette 1 Ko
 * - cartes 64 Ko par carte (nb cartes ~300 niv 18 )
 * - table par niveau 
 */

